tap "homebrew/bundle"
tap "ms-jpq/sad"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "charmbracelet/tap"
tap "oven-sh/bun"

# ---- Programming Languages and their Package Managers ----
# Fast, disk space efficient package manager
brew "pnpm"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Language Server for Lua
brew "lua-language-server"
# A dynamic, open source programming language with a focus on simplicity and productivity.
brew "ruby"
# Perl is a highly capable, feature-rich programming language with over 30 years of development.
brew "perl"
# Python
brew "mkdocs"
# uv
brew "uv"
# Golang
brew "golang"
# Bun
brew "bun"
# Elixir
brew "elixir"
# graphite.dev
brew "withgraphite/tap/graphite"
# Bat
brew "bat"

# ---- Command Line Tools ----
# Hugo
brew "hugo"
# Handy way to save and run project-specific commands
brew "just"
# infiscal CLI
brew "infisical/get-cli/infisical"
# Official Amazon AWS command-line interface
brew "awscli"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Write terminal GIFs as code for integration testing and demoing your CLI tools.
brew "vhs"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Manage multiple Node.js version
brew "nvm"
# Easiest way to build and release mobile app
brew "fastlane"
# Watch files and take action when they change
brew "watchman"
# Cryptography and SSL/TLS Toolkit
brew "openssl"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Create, edit, compose or convert digital images (https://imagemagick.org/script/download.php)
brew "imagemagick"
# Ghostscript fonts, required by imagemagick
brew "ghostscript"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# ZSH package manager
brew "antigen"
# Search and replace | Space Age seD
brew "sad"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Cross-platform make
brew "cmake"
# Rust toolchain installer
brew "rustup"
# JQ
brew "jq"
# Flyctl is a command-line utility that lets you work with the Fly.io platform
brew "flyctl"
# Shell extension to navigate your filesystem faster
brew "zoxide"

# --- Cask ---
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Cross-platform, fast, feature-rich, GPU based terminal
cask "kitty"
# Your Place to Talk and Hang Out
cask "discord"
# A better way to build products
cask "linear-linear"
# App to write, plan, collaborate, and get organized
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Font
cask "font-fira-code-nerd-font"
# Visual Studio Code
cask "visual-studio-code"
# Logitech Options for MX Products
cask  "logitech-options"
# Desktop password and login vault
cask "bitwarden"
# Tools for building Android applications
cask "android-studio"
# System monitor for the menu bar
cask "stats"
# Google Chromium, sans integration with Google
cask "eloston-chromium"
# Replacement for Docker Desktop
cask "orbstack"
# Video game digital distribution service
cask "steam"
# Update maps and software, sync with Garmin Connect and register your device
cask "garmin-express"
# Launch builds and start simulators from your menu bar
cask "expo-orbit"
# Open source API development ecosystem
cask "hoppscotch"
# Adaptive brightness for displays
cask "vivid"
# Write, edit, and chat about your code with AI
cask "cursor"

mas "Xcode", id: 497799835
mas "WhatsApp Messenger", id: 310633997
