tap "homebrew/bundle"
tap "homebrew/cask"
tap "supabase/tap"
tap "ms-jpq/sad"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"

# ---- Programming Languages and their Package Managers ----
# Fast, disk space efficient package manager
brew "pnpm"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# A dynamic, open source programming language with a focus on simplicity and productivity.
brew "ruby"

# ---- Comamnd Line Tools ----
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Cryptography and SSL/TLS Toolkit
brew "openssl"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Create, edit, compose or convert digital images (https://imagemagick.org/script/download.php)
brew "imagemagick"
# Ghostscript fonts, required by imagemagick
brew "ghostscript"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Friendly wrapper for launchctl
brew "lunchy"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Mac App Store command-line interface
brew "mas"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Plugin manager for zsh
brew "antidote"
# Search and replace | Space Age seD
brew "sad"
# Supabase CLI
brew "supabase"
# Cross-platform make
brew "cmake"
# Rust toolchain installer
brew "rustup-init"

# --- Cask ---
# Cross-platform, fast, feature-rich, GPU based terminal
cask "kitty"
# Web browser
cask "google-chrome"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Interface for reading and syncing eBooks
cask "kindle"
# Office Applications
cask "microsoft-office"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Collaborative presentation software for modern teams
cask "pitch"
# Your Place to Talk and Hang Out
cask "discord"
# A better way to build products
cask "linear-linear"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Font
cask "font-fira-code-nerd-font"
# Visual Studio Code
cask "visual-studio-code"
# Logitech Options for MX Products
cask  "logitech-options"