tap "homebrew/bundle"
tap "homebrew/cask"
tap "supabase/tap"
tap "ms-jpq/sad"
tap "fsouza/prettierd"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "charmbracelet/tap"
tap "getsentry/tools"
tap "oven-sh/bun"

# ---- Programming Languages and their Package Managers ----
# Fast, disk space efficient package manager
brew "pnpm"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Language Server for Lua
brew "lua-language-server"
# A dynamic, open source programming language with a focus on simplicity and productivity.
brew "ruby"
# Perl is a highly capable, feature-rich programming language with over 30 years of development.
brew "perl"
# Prettier, but fast
brew "prettierd"
# Golang
brew "golang"
# Java
brew "java"
# Java 17
brew "openjdk@17"
# Java 11
brew "openjdk@11"
# Java 8
brew "openjdk@8"
# Bun
brew "bun"

# ---- Command Line Tools ----
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Sentry CLI
brew "getsentry/tools/sentry-cli"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Write terminal GIFs as code for integration testing and demoing your CLI tools.
brew "vhs"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Manage multiple Node.js version
brew "nvm"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Easiest way to build and release mobile app
brew "fastlane"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Watch files and take action when they change
brew "watchman"
# Cryptography and SSL/TLS Toolkit
brew "openssl"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Create, edit, compose or convert digital images (https://imagemagick.org/script/download.php)
brew "imagemagick"
# Ghostscript fonts, required by imagemagick
brew "ghostscript"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Simple terminal UI for git commands
brew "lazygit"
# Friendly wrapper for launchctl
brew "lunchy"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Mac App Store command-line interface
brew "mas"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Instant terminal sharing
brew "tmate"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Plugin manager for zsh
brew "antidote"
# Search and replace | Space Age seD
brew "sad"
# Supabase CLI
brew "supabase"
# Cross-platform make
brew "cmake"
# Rust toolchain installer
brew "rustup"
# Terraform
brew "terraform"
# PostgreSQL
brew "postgresql@14"
# JQ
brew "jq"
# A modern runtime for JavaScript and TypeScript
brew "deno"
# Flyctl is a command-line utility that lets you work with the Fly.io platform
brew "flyctl"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Stuff to build node-canvas with arm chip
brew "pkg-config"
brew "cairo"
brew "pango"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"

# --- Cask ---
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Cross-platform, fast, feature-rich, GPU based terminal
cask "kitty"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Interface for reading and syncing eBooks
cask "kindle"
# Office Applications
# cask "microsoft-office"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Communication tool for focused discussions and decision taking
cask "threads"
# Collaborative presentation software for modern teams
cask "pitch"
# Your Place to Talk and Hang Out
cask "discord"
# A better way to build products
cask "linear-linear"
# App to write, plan, collaborate, and get organized
cask "notion"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Font
cask "font-fira-code-nerd-font"
# Visual Studio Code
cask "visual-studio-code"
# Logitech Options for MX Products
cask  "logitech-options"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Video communication and virtual meeting platform
cask "zoom"
# Desktop password and login vault
cask "bitwarden"
# Screen and video recording software
cask "loom"
# Tools for building Android applications
cask "android-studio"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# System monitor for the menu bar
cask "stats"
# Google Chromium, sans integration with Google
cask "eloston-chromium"
# Replacement for Docker Desktop
cask "orbstack"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Video game digital distribution service
cask "steam"

mas "Xcode", id: 497799835
